Autodesk.Revit.DB.IFC.IFCImportIntent
The intent of the IFC import.
Since:
2015

Autodesk.Revit.DB.IFC.IFCImportIntent.Reference
Imports the IFC file to serve as a reference (lightweight and accurate representations will be constructed, but they cannot be edited as standard Revit elements).

Autodesk.Revit.DB.IFC.IFCImportIntent.Parametric
Imports the IFC file to allow for continued editing in Revit (standard Revit elements will be created).